RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_mdma.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(node)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(block_init_struct)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_POINTER);
    } else if(NOT_MDMA_MULTI_BLOCK_NUM(block_init_struct->block_num)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_POINTER);
    } else if(NOT_MDMA_REQUEST(init_struct->request)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else if(NOT_MDMA_TRANS_TRIG(init_struct->trans_trig_mode)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else if(NOT_MDMA_PRIORITY(init_struct->priority)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else if(NOT_MDMA_ENDIANNESS(init_struct->endianness)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else if(NOT_MDMA_SOURCE_INC(init_struct->source_inc)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else if(NOT_MDMA_DEST_INC(init_struct->dest_inc)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else if(NOT_MDMA_SOURCE_DATA_SIZE(init_struct->source_data_size)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else if(NOT_MDMA_DEST_DATA_SIZE(init_struct->dest_data_size)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else if(NOT_MDMA_DATA_ALIGN(init_struct->data_alignment)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else if(NOT_MDMA_BUFF_TRANS_LEN(init_struct->buff_trans_len)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_OUT_OF_RANGE);
    } else if(NOT_MDMA_SOURCE_BURST(init_struct->source_burst)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else if(NOT_MDMA_DEST_BURST(init_struct->dest_burst)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID); 
    } else if(NOT_MDMA_TBYTES_NUM(init_struct->tbytes_num_in_block)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else if(NOT_MDMA_SOURCE_BUS(init_struct->source_bus)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else if(NOT_MDMA_DEST_BUS(init_struct->dest_bus)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else if(NOT_MDMA_BUFFERABLE_WRITE(init_struct->bufferable_write_mode)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x0009U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure channel configure register */
        cfg = (init_struct->data_alignment | init_struct->dest_burst | init_struct->dest_data_size | init_struct->dest_inc | \
               init_struct->source_burst | init_struct->source_data_size | init_struct->source_inc | init_struct->trans_trig_mode | \
               ((init_struct->buff_trans_len << CHXCFG_BTLEN_OFFSET) & MDMA_CHXCFG_BTLEN) | init_struct->bufferable_write_mode);
        node->chxcfg_reg = cfg;

        /* configure channel request source */
        if(MDMA_REQUEST_SW == init_struct->request) {
            node->chxcfg_reg |= MDMA_CHXCFG_SWREQMOD;
        } else {
            node->chxctl1_reg &= ~MDMA_CHXCTL1_TRIGSEL;
            node->chxctl1_reg |= init_struct->request;
        }
        /* configure bus type for source and destination */
        node->chxctl1_reg &= ~(MDMA_CHXCTL1_SBSEL | MDMA_CHXCTL1_DBSEL);
        node->chxctl1_reg |= (init_struct->source_bus | init_struct->dest_bus);
        
        /* configure channel block transfer configure register */
        cfg = (((block_init_struct->block_num << CHXBTCFG_BRNUM_OFFSET) & MDMA_CHXBTCFG_BRNUM)| (init_struct->tbytes_num_in_block & MDMA_CHXBTCFG_TBNUM));
        node->chxbtcfg_reg = cfg;

        /* configure source address, destination address, mask address and mask data */
        node->chxsaddr_reg = init_struct->source_addr;
        node->chxdaddr_reg = init_struct->dest_addr;
        node->chxmaddr_reg = init_struct->mask_addr;
        node->chxmdata_reg = init_struct->mask_data;

        node->chxmbaddru_reg &= ~(MDMA_CHXMBADDRU_SADDRUV | MDMA_CHXMBADDRU_DADDRUV);
        /* if block source address offset is negative, set the block repeat source address update mode to decrement */
        if(UPDATE_DIR_DECREASE == block_init_struct->saddr_update_dir) {
            node->chxbtcfg_reg |= MDMA_CHXBTCFG_SADDRUM;
            /* write new chxmbaddru register value: source repeat block offset */
            blockoffset = (uint32_t)block_init_struct->saddr_update_val;
            node->chxmbaddru_reg |= (blockoffset & MDMA_ADDRESS_MASK);
        } else {
            node->chxbtcfg_reg &= ~MDMA_CHXBTCFG_SADDRUM;
            /* write new chxmbaddru register value: source repeat block offset */
            node->chxmbaddru_reg |= (((uint32_t)block_init_struct->saddr_update_val) & MDMA_ADDRESS_MASK);
        }

        if(UPDATE_DIR_DECREASE == block_init_struct->dstaddr_update_dir) {
            node->chxbtcfg_reg |= MDMA_CHXBTCFG_DADDRUM;
            /* write new chxmbaddru register value: destination repeat block offset */
            blockoffset = (uint32_t)block_init_struct->dstaddr_update_val;
            node->chxmbaddru_reg |= ((uint32_t)(blockoffset & MDMA_ADDRESS_MASK) << CHXMBADDRU_DADDRUV_OFFSET);
        } else {
            node->chxbtcfg_reg &= ~MDMA_CHXBTCFG_DADDRUM;
            /* write new chxmbaddru register value: destination repeat block offset */
            node->chxmbaddru_reg |= ((((uint32_t)block_init_struct->dstaddr_update_val) & MDMA_ADDRESS_MASK) << CHXMBADDRU_DADDRUV_OFFSET);
        }

        node->chxladdr_reg = 0U;
        node->reserved = 0U;
    }
}

/*!
    \brief      MDMA add node to link list (API_ID(0x000AU))
    \param[in]  pre_node: previous structure node pointer, members of the structure and the member values are shown as below:
                  chxcfg_reg: channel configure register
                  chxbtcfg_reg: channel block transfer configure register
                  chxsaddr_reg: channel source address register
                  chxdaddr_reg: channel destination address register
                  chxmbaddru_reg: channel multi-block address update register
                  chxladdr_reg: channel link address register
                  chxctl1_reg: channel control register 1
                  chxmaddr_reg: channel mask address register
                  chxmdata_reg: channel mask data register
    \param[in]  new_node: new node pointer, members of the structure and the member values are shown as below:
                  chxcfg_reg: channel configure register
                  chxbtcfg_reg: channel block transfer configure register
                  chxsaddr_reg: channel source address register
                  chxdaddr_reg: channel destination address register
                  chxmbaddru_reg: channel multi-block address update register
                  chxladdr_reg: channel link address register
                  chxctl1_reg: channel control register 1
                  chxmaddr_reg: channel mask address register
                  chxmdata_reg: channel mask data register
    \param[out] none
    \retval     none
*/
void mdma_node_add(mdma_link_node_parameter_struct *pre_node, mdma_link_node_parameter_struct *new_node)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(pre_node)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x000AU), ERR_PARAM_POINTER);
    } else if(NOT_VALID_POINTER(new_node)) {
        fw_debug_report_err(MDMA_MODULE_ID, API_ID(0x000AU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        pre_node->chxladdr_reg = (uint32_t)new_node;
    }
}

/*!
    \brief      MDMA disconnect link list node (API_ID(0x000BU))
    \param[in]  pre_node: previous structure node pointer, members of the structure and the member values are shown as below:
                  chxcfg_reg: channel configure register
                  chxbtcfg_reg: channel block transfer configure register
                  chxsaddr_reg: channel source address register
                  chxdaddr_reg: channel destination address register
                  chxmbaddru_reg: channel multi-block address update register
                  chxladdr_reg: channel link address register
                  chxctl1_reg: channel control register 1
                  chxmaddr_reg: channel mask address register
                  chxmdata_reg: channel mask data register
    \param[in]  unused_node: unused link list node pointer, members of the structure and the member values are shown as below:
                  chxcfg_reg: channel configure register
                  chxbtcfg_reg: channel block transfer configure register
                  chxsaddr_reg: channel source address register
                  chxdaddr_reg: channel destination address register
                  chxmbaddru_reg: channel multi-block address update register
                  chxladdr_reg: channel link address register
                  chxctl1_reg: channel control register 1
                  chxmaddr_reg: channel mask address register
                  chxmdata_reg: channel mask data register
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus mdma_node_delete(mdma_link_node_parameter_struct *pre_node, mdma_link_node_parameter_struct *unused_node)
{
    ErrStatus reval = ERROR;

